app/Controllers/Contratante.php

    public function search()
    {
        $cnpj = $this->request->getPost('pesquisar');
        $contratante = $this->contratante->findByCnpj($cnpj);

        if (!$contratante) {
            return redirect()->to('contrato')->with('error', 'CNPJ não encontrado');
        }

        $data['contratante'] = $this->contratante->getDadosCompletos($contratante->id);
        $data['faturamento'] = $this->faturamento->findAll();
---
SELECT *
FROM `faturamento`