app/Controllers/Contratante.php

    public function index(): string
    {
        $data['title'] = 'contratante';
        $data['contratante'] = $this->contratante
            ->select('contratante.*, representante.nome AS representante_nome, faturamento.prazo AS prazo_faturamento')
            ->join('representante', 'representante.id = contratante.representante_id', 'left')
            ->join('faturamento', 'faturamento.id = contratante.faturamento_id', 'left')
            ->findAll();
---
SELECT `contratante`.*, `representante`.`nome` AS `representante_nome`, `faturamento`.`prazo` AS `prazo_faturamento`
FROM `contratante`
LEFT JOIN `representante` ON `representante`.`id` = `contratante`.`representante_id`
LEFT JOIN `faturamento` ON `faturamento`.`id` = `contratante`.`faturamento_id`

    public function search()
    {
        $cnpj = $this->request->getPost('cnpj');
        $contratante = $this->contratante->findByCnpj($cnpj);

        if (!$contratante) {
            return redirect()->to('contratante')->with('error', 'CNPJ não encontrado');
        }

        $data['contratante'] = $this->contratante->getDadosCompletos($contratante->id);
        $data['faturamento'] = $this->faturamento->findAll();
---
SELECT *
FROM `faturamento`