app/Models/ContratanteModel.php

SELECT *
FROM `contratante`
WHERE `cnpj` = '11111111111311'
 LIMIT 1
---
    public function findByCnpj(string $cnpj): ?array
    {
        $sanitizedCnpj = preg_replace('/[^0-9]/', '', $cnpj);
        return $this->where('cnpj', $sanitizedCnpj)->first();